; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_2 ?v10 ?v7)
             (pred_1 ?v6 ?v5)
             (pred_9 ?v10 ?v5)
             (pred_12 ?v13 ?v10 )
	     (pred_4 ?v10)
             (pred_3 ?v11)
             (pred_6 ?v6)
             (pred_11 ?v5)
             (pred_10 ?v10)
             (pred_7 ?v6)
             (pred_5 ?v10)
             (pred_8 ))



(:action op_2
:parameters (?v3 ?v9 ?v8 ?v1)
:precondition (and (pred_3 ?v3) (pred_3 ?v9) (pred_6 ?v8) (pred_11 ?v1)
          (pred_2 ?v3 ?v9) (pred_1 ?v8 ?v1)
                   (pred_9 ?v9 ?v1) (pred_4 ?v3) 
                   (pred_10 ?v9) (pred_7 ?v8))
:effect (and  (pred_5 ?v9) (not (pred_10 ?v9))))


(:action op_5
:parameters (?v3 ?v12)
:precondition (and (pred_3 ?v3) (pred_3 ?v12)
               (pred_4 ?v3) (pred_2 ?v3 ?v12) (pred_5 ?v12))
:effect (and (pred_4 ?v12) (not (pred_4 ?v3))))

(:action op_3
:parameters (?v3 ?v8)
:precondition (and (pred_3 ?v3) (pred_6 ?v8) 
                  (pred_4 ?v3) (pred_12 ?v8 ?v3) (pred_8 ))
:effect (and (pred_7 ?v8)
   (not (pred_12 ?v8 ?v3)) (not (pred_8 ))))


(:action op_1
:parameters (?v3 ?v4 ?v2)
:precondition (and (pred_3 ?v3) (pred_6 ?v4) (pred_6 ?v2)
                  (pred_4 ?v3) (pred_7 ?v2) (pred_12 ?v4 ?v3))
:effect (and (pred_7 ?v4) (pred_12 ?v2 ?v3)
        (not (pred_7 ?v2)) (not (pred_12 ?v4 ?v3))))

(:action op_4
:parameters (?v3 ?v8)
:precondition (and (pred_3 ?v3) (pred_6 ?v8) 
                  (pred_4 ?v3) (pred_7 ?v8))
:effect (and (pred_8 ) (pred_12 ?v8 ?v3) (not (pred_7 ?v8)))))

; problem
(define (problem grid-3-3-2-2-2)
    (:domain grid)
    (:objects
    obj_03 obj_11 obj_06 obj_10 obj_02 obj_12 obj_01 obj_07 obj_08
    obj_04 obj_05
    obj_09 obj_13
    )

    (:init
       (pred_8)

       (pred_3 obj_03)
       (pred_3 obj_11)
       (pred_3 obj_06)
       (pred_3 obj_10)
       (pred_3 obj_02)
       (pred_3 obj_12)
       (pred_3 obj_01)
       (pred_3 obj_07)
       (pred_3 obj_08)
       (pred_11 obj_04)
       (pred_11 obj_05)
       (pred_6 obj_09)
       (pred_6 obj_13)

       (pred_2 obj_03 obj_10)
       (pred_2 obj_03 obj_11)
       (pred_2 obj_11 obj_02)
       (pred_2 obj_11 obj_06)
       (pred_2 obj_11 obj_03)
       (pred_2 obj_06 obj_12)
       (pred_2 obj_06 obj_11)
       (pred_2 obj_10 obj_01)
       (pred_2 obj_10 obj_02)
       (pred_2 obj_10 obj_03)
       (pred_2 obj_02 obj_07)
       (pred_2 obj_02 obj_12)
       (pred_2 obj_02 obj_11)
       (pred_2 obj_02 obj_10)
       (pred_2 obj_12 obj_08)
       (pred_2 obj_12 obj_06)
       (pred_2 obj_12 obj_02)
       (pred_2 obj_01 obj_07)
       (pred_2 obj_01 obj_10)
       (pred_2 obj_07 obj_08)
       (pred_2 obj_07 obj_02)
       (pred_2 obj_07 obj_01)
       (pred_2 obj_08 obj_12)
       (pred_2 obj_08 obj_07)
       (pred_10 obj_03)
       (pred_10 obj_11)
       (pred_9  obj_03 obj_04)
       (pred_9  obj_11 obj_05)
       (pred_5 obj_06)
       (pred_5 obj_10)
       (pred_5 obj_02)
       (pred_5 obj_12)
       (pred_5 obj_01)
       (pred_5 obj_07)
       (pred_5 obj_08)

       (pred_1  obj_09 obj_04)
       (pred_1  obj_13 obj_05)
       (pred_12 obj_09 obj_10)
       (pred_12 obj_13 obj_07)
       (pred_4 obj_01)
    )

    (:goal (and
       (pred_12 obj_09 obj_07)
       (pred_12 obj_13 obj_12)
    ))
(:constraints
  (always (not (pred_4 obj_02)))
)
)

; plan
1. (op_5 obj_01 obj_07)
   deleted: (pred_4 obj_01)
   added: (pred_4 obj_07)
   goals met: 0 of 2
2. (op_3 obj_07 obj_13)
   deleted: (pred_12 obj_13 obj_07) (pred_8)
   added: (pred_7 obj_13)
   goals met: 0 of 2
3. (op_5 obj_07 obj_01)
   deleted: (pred_4 obj_07)
   added: (pred_4 obj_01)
   goals met: 0 of 2
4. (op_5 obj_01 obj_10)
   deleted: (pred_4 obj_01)
   added: (pred_4 obj_10)
   goals met: 0 of 2
5. (op_1 obj_10 obj_09 obj_13)
   deleted: (pred_7 obj_13) (pred_12 obj_09 obj_10)
   added: (pred_7 obj_09) (pred_12 obj_13 obj_10)
   goals met: 0 of 2
6. (op_5 obj_10 obj_01)
   deleted: (pred_4 obj_10)
   added: (pred_4 obj_01)
   goals met: 0 of 2
7. (op_5 obj_01 obj_07)
   deleted: (pred_4 obj_01)
   added: (pred_4 obj_07)
   goals met: 0 of 2
8. (op_4 obj_07 obj_09)
   deleted: (pred_7 obj_09)
   added: (pred_8) (pred_12 obj_09 obj_07)
   goals met: 1 of 2
9. (op_5 obj_07 obj_01)
   deleted: (pred_4 obj_07)
   added: (pred_4 obj_01)
   goals met: 1 of 2
10. (op_5 obj_01 obj_10)
   deleted: (pred_4 obj_01)
   added: (pred_4 obj_10)
   goals met: 1 of 2
11. (op_3 obj_10 obj_13)
   deleted: (pred_12 obj_13 obj_10) (pred_8)
   added: (pred_7 obj_13)
   goals met: 1 of 2
12. (op_5 obj_10 obj_01)
   deleted: (pred_4 obj_10)
   added: (pred_4 obj_01)
   goals met: 1 of 2
13. (op_5 obj_01 obj_07)
   deleted: (pred_4 obj_01)
   added: (pred_4 obj_07)
   goals met: 1 of 2
14. (op_5 obj_07 obj_08)
   deleted: (pred_4 obj_07)
   added: (pred_4 obj_08)
   goals met: 1 of 2
15. (op_5 obj_08 obj_12)
   deleted: (pred_4 obj_08)
   added: (pred_4 obj_12)
   goals met: 1 of 2
16. (op_4 obj_12 obj_13)
   deleted: (pred_7 obj_13)
   added: (pred_8) (pred_12 obj_13 obj_12)
   goals met: 2 of 2
